<?php
// +----------------------------------------------------------------------
// | HisiPHP框架[基于ThinkPHP5.1开发]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2021 http://www.hisiphp.com
// +----------------------------------------------------------------------
// | HisiPHP承诺基础框架永久免费开源，您可用于学习和商用，但必须保留软件版权信息。
// +----------------------------------------------------------------------
// | Author: 橘子俊 <364666827@qq.com>，开发者QQ群：50304283
// +----------------------------------------------------------------------

namespace app\team\validate;

use think\Validate;

/**
 * 用户验证器
 * @package app\team\validate
 */
class Dept extends Validate
{
    //定义验证规则
    protected $rule = [
        'name|部门名称'       => 'require|unique:_dept',
        'order|排序'          =>'number|>=:0'
    ];

    //定义验证提示
    protected $message = [
        'name.require' => '请输入部门名称',
        'order.number' => '排序必须是正数'
    ];
}
